cask_args appdir: '/Applications'

tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "camspiers/taps"
tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"
tap "cmacrae/formulae"

# Homebrew essentials
brew "luarocks"
brew "bash"
brew "bash-completion"
brew "bat"
brew "composer"
brew "coreutils"
brew "editorconfig"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mkcert"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "node"
brew "pandoc"
brew "pkg-config"
brew "python"
brew "rbenv"
brew "readline"
brew "ripgrep"
brew "rlue/utils/timer"
brew "rbenv"
brew "starship"
brew "vim"
brew "wget"
brew "cmacrae/formulae/spacebar"
brew "yarn"
brew "cmake"
brew "zsh-async"
brew "zsh-autopair"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-you-should-use"
brew "docker"
brew "docker-machine"
brew "docker-completion"
brew "docker-credential-helper"
brew "docker-gen" 
brew "docker-clean"
brew "dateutils"
brew "docutils"
brew "findutils"
brew "icoutils"
brew "inetutils"
brew "moreutils"
brew "osxutils"
brew "patchutils" 
brew "renameutils"
brew "t1utils"
brew "usbutils"
brew "uniutils"
brew "pinentry-mac"
brew "mackup"
brew "mac-robber" 
brew "libapplewm"
brew "appstream"
brew "appstream-glib"
brew "pyenv-virtualenvwrapper" 
brew "virtualenvwrapper" 
brew "gpg" 


# App essentials
cask "anki"
cask "font-hasklug-nerd-font"
cask "fontforge"
cask "iina"
cask "kap"
cask "keycastr"
cask "kitty"
cask "utools"
cask "devutils" 
cask "macdown"
cask "macfuse"
cask "macforge"
cask "macdive" 
cask "maczip" 
cask "better-window-manager" 
