cask_args appdir: '/Applications'

tap "homebrew/cask-fonts"
tap "homebrew/bundle"
tap "homebrew/services"

# Custom taps
tap "camspiers/taps"
tap "koekeishiya/formulae"
tap "Rigellute/tap"
tap "Schniz/tap"
tap "rlue/utils"
tap "cmacrae/formulae"

# Homebrew essentials
brew "luarocks"
brew "bash"
brew "bash-completion"
brew "bat"
brew "composer"
brew "coreutils"
brew "editorconfig"
brew "fnm"
brew "fontconfig"
brew "fpp"
brew "fzf"
brew "gawk"
brew "git"
brew "gnu-sed"
brew "ifstat"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mkcert"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "node"
brew "pandoc"
brew "pkg-config"
brew "python"
brew "rbenv"
brew "readline"
brew "ripgrep"
brew "rlue/utils/timer"
brew "rbenv"
brew "starship"
brew "vim"
brew "wget"
brew "cmacrae/formulae/spacebar"
brew "yarn"
brew "cmake"
brew "zsh-async"
brew "zsh-autopair"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-you-should-use"
brew "docker"
brew "docker-machine"
brew "docker-completion"
brew "docker-credential-helper"
brew "docker-gen" 
brew "docker-clean"
brew "dateutils"
brew "docutils"
brew "findutils"
brew "icoutils"
brew "inetutils"
brew "moreutils"
brew "osxutils"
brew "patchutils" 
brew "renameutils"
brew "t1utils"
brew "usbutils"
brew "uniutils"
brew "pinentry-mac"
brew "mackup"
brew "mac-robber" 
brew "libapplewm"
brew "appstream"
brew "appstream-glib"
brew "pyenv-virtualenvwrapper" 
brew "virtualenvwrapper" 
brew "gpg" 
brew "gh"
brew "adwaita-icon-theme"
brew "aescrypt"
brew "aom"
brew "appstream"
brew "appstream-glib"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "aspell"
brew "autoconf"
brew "bash"
brew "bash-completion"
brew "bat"
brew "berkeley-db@5"
brew "blake3"
brew "boost"
brew "bpython"
brew "brew-cask-completion"
brew "brew-gem"
brew "brew-php-switcher"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "catimg"
brew "ccache"
brew "certifi"
brew "cffi"
brew "cfitsio"
brew "cgif"
brew "cimg"
brew "cjson"
brew "cmake"
brew "composer"
brew "coreutils"
brew "cryptography"
brew "curl"
brew "dateutils"
brew "dav1d"
brew "direnv"
brew "dmg2img"
brew "docker"
brew "docker-clean"
brew "docker-completion"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-gen"
brew "docker-machine"
brew "docutils"
brew "editorconfig"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "flac"
brew "fmt"
brew "fnm"
brew "fontconfig"
brew "fontforge"
brew "fpp"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gd"
brew "gdbm"
brew "gdk-pixbuf"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "giflib"
brew "git"
brew "git-archive-all"
brew "git-filter-repo"
brew "git-fixup"
brew "git-grab"
brew "git-gui"
brew "git-machete"
brew "git-sizer"
brew "git-trim"
brew "gitlint"
brew "glib"
brew "gmp"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "gopls"
brew "gpgme"
brew "graphicsmagick"
brew "graphite2"
brew "graphviz"
brew "gts"
brew "harfbuzz"
brew "hdf5"
brew "highway"
brew "hiredis"
brew "hwloc"
brew "iconsur"
brew "icoutils"
brew "icu4c"
brew "ifstat"
brew "imagemagick"
brew "imath"
brew "imgproxy"
brew "inetutils"
brew "ipython"
brew "isl"
brew "jasper"
brew "jbig2dec"
brew "joplin-cli"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "json-glib"
brew "krb5"
brew "lame"
brew "lazydocker"
brew "lazygit"
brew "leptonica"
brew "libaec"
brew "libapplewm"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libcanberra"
brew "libcbor"
brew "libccd"
brew "libcddb"
brew "libcdio"
brew "libcdr"
brew "libcec"
brew "libcerf"
brew "libconfig"
brew "libcpuid"
brew "libcsv"
brew "libcue"
brew "libcyaml"
brew "libde265"
brew "libdeflate"
brew "libdicom"
brew "libevent"
brew "libexif"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libheif"
brew "libice"
brew "libidn"
brew "libidn2"
brew "libimagequant"
brew "libksba"
brew "liblqr"
brew "libmatio"
brew "libmicrohttpd"
brew "libmpc"
brew "libnghttp2"
brew "libogg"
brew "libomp"
brew "libplist"
brew "libpng"
brew "libpq"
brew "libraw"
brew "librevenge"
brew "librist"
brew "librsvg"
brew "libsamplerate"
brew "libsixel"
brew "libsm"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libspiro"
brew "libspng"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunibreak"
brew "libuninameslist"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxaw"
brew "libxc"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxft"
brew "libxinerama"
brew "libxml2"
brew "libxmlb"
brew "libxmu"
brew "libxpm"
brew "libxrender"
brew "libxt"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "lldpd"
brew "lpeg"
brew "lua"
brew "luajit"
brew "luarocks"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mac-robber"
brew "mackup"
brew "mad"
brew "make"
brew "mbedtls"
brew "meta-package-manager"
brew "mkcert"
brew "moreutils"
brew "mozjpeg"
brew "mpdecimal"
brew "mpfr"
brew "mpg123"
brew "msgpack"
brew "mycli"
brew "nbimg"
brew "ncurses"
brew "neovim"
brew "netpbm"
brew "nettle"
brew "node"
brew "nodebrew"
brew "npth"
brew "nspr"
brew "nss"
brew "oniguruma"
brew "open-mpi"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openldap"
brew "openslide"
brew "openssl@3"
brew "opus"
brew "opusfile"
brew "osxutils"
brew "p11-kit"
brew "pandoc"
brew "pango"
brew "patchutils"
brew "pcre2"
brew "perl"
brew "php"
brew "php@8.1"
brew "phpbrew"
brew "pinentry"
brew "pinentry-mac"
brew "pixman"
brew "pkg-config"
brew "pmix"
brew "pnpm"
brew "poppler"
brew "prettier"
brew "pycparser"
brew "pyenv"
brew "pyenv-virtualenvwrapper"
brew "python-setuptools"
brew "python-typing-extensions"
brew "python@3.12"
brew "rav1e"
brew "rbenv"
brew "readline"
brew "renameutils"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "ruby-build"
brew "rustup-init"
brew "sccache"
brew "sdl2"
brew "shared-mime-info"
brew "simg2img"
brew "simgrid"
brew "snappy"
brew "sox"
brew "speex"
brew "sqlite"
brew "srt"
brew "starship"
brew "svt-av1"
brew "t1utils"
brew "tcl-tk"
brew "term"
brew "terminal-notifier"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "timer"
brew "timg"
brew "tldr"
brew "tree-sitter"
brew "unbound"
brew "unibilium"
brew "uniutils"
brew "unixodbc"
brew "usbutils"
brew "uthash"
brew "vedic"
brew "vim"
brew "vips"
brew "virtualenvwrapper"
brew "wasm3"
brew "webp"
brew "wget"
brew "whalebrew"
brew "woff2"
brew "x264"
brew "x265"
brew "xcodes"
brew "xorgproto"
brew "xterm"
brew "xvid"
brew "xxhash"
brew "xz"
brew "yarn"
brew "zeromq"
brew "zimg"
brew "zsh-async"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-navigation-tools"
brew "zsh-you-should-use"
brew "zstd"

# App essentials
cask "alt-tab"
cask "anki"
cask "better-window-manager"
cask "bootxchanger"
cask "brewtarget"
cask "cakebrew"
cask "cakebrewjs"
cask "ccleaner"
cask "clean-me"
cask "cleanapp"
cask "cmdtap"
cask "color-oracle"
cask "color-studio"
cask "colorsnapper"
cask "colortester"
cask "colorwell"
cask "cryptomator"
cask "devcleaner"
cask "devutils"
cask "discord"
cask "docker"
cask "docker-toolbox"
cask "dockx"
cask "dropbox-dash"
cask "dropbox@beta"
cask "firefox@developer-edition"
cask "firefox@nightly"
cask "font-gohufont-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-ntr"
cask "font-profont-nerd-font"
cask "font-rubik-80s-fade"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "font-sf-pro"
cask "fontbase"
cask "fontfinagler"
cask "fontforge"
cask "fontlab"
cask "fontplop"
cask "git-credential-manager"
cask "git-it"
cask "gitnote"
cask "hiddenbar"
cask "hidock"
cask "install-disk-creator"
cask "iterm2@beta"
cask "kext-utility"
cask "keycastr"
cask "kitty"
cask "maccleaner-pro"
cask "macdive"
cask "macdown"
cask "macforge"
cask "macfuse"
cask "maczip"
cask "mist"
cask "rightfont"
cask "robofont"
cask "sf"
cask "sf-symbols"
cask "sfdx"
cask "sim-genie"
cask "skyfonts"
cask "spotify"
cask "telegram-desktop"
cask "tor-browser"
cask "transmission@nightly"
cask "veracrypt"
cask "virtualbox"

cask "font-hasklug-nerd-font"
cask "kitty"
cask "devutils" 
cask "macdown"
cask "macfuse"
cask "macforge"
cask "macdive" 
cask "maczip" 
cask "better-window-manager" 
